// توضیحات کلی

// DIP = کلاس‌ها نباید به کلاس‌های مشخص وابسته باشند بلکه باید به قرارداد کلی وابسته باشند.

// IOC = کلاس خودش تصمیم نمی‌گیرد از چه چیزی استفاده کند یک جای دیگر برایش تصمیم می‌گیرد.

// IOC Container = یک فضا یا جعبه ی هوشمند که اشیا را درست می‌کند و به بقیه می‌دهد.

// Factory as IOC Container = Factory یک IoC Container خیلی ساده و ابتدایی است. یک کلاس که فقط کارش ساختن اشیا است.

// Dependency Injection = وابستگی‌ها را از بیرون به یک کلاس بدهیم نه اینکه داخل خود کلاس ساخته شوند.

// Service LifeTimes in .Net = هر شئ تا چه مدت زنده بماند.




// ارتباط با یکدیگر

// 1) DIP = میگوید چطور وابسته باشیم
// 2) IOC = ایده ی کلی همه چیزاست
// 3) DI = روش انجام IOC یا همان ایده ی کلی است
// 4) IOC Container = ابزار انجام DI است
// 5) Factory = نسخه ی خیلی ساده از IOC Container است
// 6) Service Lifetime = میگوید هر شئ چقدر عمر میکند